# AddInIdAttribute Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInIdAttribute Constructor
AddInIdAttribute Class See Also
---
Constructs a new AddInIdAttribute.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AddInIdAttribute(
	string addInIdStr
)
```

Visual Basic
---
```text
Public Sub New ( _
	addInIdStr As String _
)
```

Visual C++
---
```text
public:
AddInIdAttribute(
	String^ addInIdStr
)
```

# ### Parameters
addInIdStr
    Type: System..::..String
# See Also
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace